Repository: starriv/vicu
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# orders.detail.filled_quantity_average_price
source: Filled Qty / Avg Price
zh_hans: 成交数量/均价

# orders.detail.high_water_mark
source: High Water Mark
zh_hans: 高水位

# orders.detail.legs
source: Legs
zh_hans: 订单腿

# orders.detail.limit_price
source: Limit Price
zh_hans: 限价

# orders.detail.metadata
source: Metadata
zh_hans: 元数据

# orders.detail.name_code
source: Name / Symbol
zh_hans: 名称代码

# orders.detail.navigation_title
source: Trade Details
zh_hans: 交易详情

# orders.detail.no
source: No
zh_hans: 否

# orders.detail.no_fill_details
source: No fill details yet.
zh_hans: 暂无成交明细。

# orders.detail.notional
source: Notional
zh_hans: 名义金额

# orders.detail.order_amount
source: Order Amount
zh_hans: 订单金额

# orders.detail.order_class
source: Order Class
zh_hans: 订单类别

# orders.detail.order_id
source: Order ID
zh_hans: 订单 ID

# orders.detail.order_quantity_price
source: Order Qty / Price
zh_hans: 订单数量/价格

# orders.detail.order_status
source: Order Status
zh_hans: 订单状态

# orders.detail.order_type
source: Order Type
zh_hans: 订单类型

# orders.detail.order_type.limit
source: Limit Order
zh_hans: 限价单

# orders.detail.order_type.market
source: Market Order
zh_hans: 市价单

# orders.detail.order_type.stop
source: Stop Order
zh_hans: 止损单

# orders.detail.order_type.stop_limit
source: Stop Limit Order
zh_hans: 止损限价单

# orders.detail.order_type.trailing_stop
source: Trailing Stop Order
zh_hans: 跟踪止损单

# orders.detail.placed_at
source: Placed At
zh_hans: 下单时间

# orders.detail.position_intent
source: Position Intent
zh_hans: 持仓意图

# orders.detail.price_conditions
source: Price Conditions
zh_hans: 价格条件

# orders.detail.quantity
source: Quantity
zh_hans: 数量

# orders.detail.replaced_at
source: Replaced
zh_hans: 替换时间

# orders.detail.replaced_by
source: Replaced By
zh_hans: 被替换为

# orders.detail.replaces
source: Replaces
zh_hans: 替换订单

# orders.detail.retry
source: Retry
zh_hans: 重试

# orders.detail.session
source: Session
zh_hans: 时段

# orders.detail.session.extended
source: Extended Hours
zh_hans: 盘前盘后

# orders.detail.session.regular
source: Regular
zh_hans: 常规时段

# orders.detail.side
source: Side
zh_hans: 方向

# orders.detail.side.buy
source: Buy
zh_hans: 买入

# orders.detail.side.sell
source: Sell
zh_hans: 卖出

# orders.detail.source
source: Source
zh_hans: 来源

# orders.detail.status
source: Status
zh_hans: 状态

# orders.detail.status.accepted
source: Accepted
zh_hans: 已受理

# orders.detail.status.canceled
source: Canceled
zh_hans: 已取消

# orders.detail.status.expired
source: Expired
zh_hans: 已过期

# orders.detail.status.failed
source: Failed
zh_hans: 失败

# orders.detail.status.filled
source: Filled
zh_hans: 全部成交

# orders.detail.status.partially_filled
source: Partially Filled
zh_hans: 部分成交

# orders.detail.stop_price
source: Stop Price
zh_hans: 止损价

# orders.detail.submitted_at
source: Submitted
zh_hans: 提交时间

# orders.detail.subtag
source: Subtag
zh_hans: 子标签

# orders.detail.time_in_force
source: Time in Force
zh_hans: 有效期类型

# orders.detail.time_in_force.cls
source: At Close
zh_hans: 收盘成交

# orders.detail.time_in_force.day
source: Day
zh_hans: 当日有效

# orders.detail.time_in_force.fok
source: Fill or Kill
zh_hans: 全部成交或取消

# orders.detail.time_in_force.gtc
source: Good Till Canceled
zh_hans: 撤销前有效

# orders.detail.time_in_force.ioc
source: Immediate or Cancel
zh_hans: 立即成交或取消

# orders.detail.time_in_force.opg
source: At Open
zh_hans: 开盘成交

# orders.detail.timeline
source: Timeline
zh_hans: 生命周期

# orders.detail.timezone.et
source: (ET)
zh_hans: (美东)

# orders.detail.title
source: Order Details
zh_hans: 订单详情

# orders.detail.trade_direction
source: Side
zh_hans: 交易方向

# orders.detail.trail_percent
source: Trail Percent
zh_hans: 跟踪百分比

# orders.detail.trail_price
source: Trail Price
zh_hans: 跟踪价格

# orders.detail.updated_at
source: Updated
zh_hans: 更新时间

# orders.detail.yes
source: Yes
zh_hans: 是

# orders.empty.description
source: Recent Alpaca orders will appear here.
zh_hans: 最近的 Alpaca 订单会显示在这里。

# orders.empty.title
source: No Orders
zh_hans: 暂无订单

# orders.error.invalid_price
source: Enter a valid price.
zh_hans: 请输入有效价格。

# orders.error.not_cancelable
source: This order cannot be canceled.
zh_hans: 当前订单不可取消。

# orders.error.not_replaceable
source: This order price cannot be changed.
zh_hans: 当前订单不可改价。

# orders.extended_hours_tag
source: EXT
zh_hans: 盘前/盘后

# orders.filter.active_count_format
source: %d active filters
zh_hans: %d 个筛选条件

# orders.filter.all
source: All
zh_hans: 全部

# orders.filter.all_symbols
source: All Symbols
zh_hans: 全部标的

# orders.filter.apply
source: Apply
zh_hans: 应用

# orders.filter.button
source: Filter
zh_hans: 筛选

# orders.filter.canceled
source: Canceled
zh_hans: 已取消

# orders.filter.end_date
source: End Date
zh_hans: 结束日期

# orders.filter.filled
source: Filled
zh_hans: 已成交

# orders.filter.no_symbols
source: No symbols available.
zh_hans: 暂无可筛选标的。

# orders.filter.open
source: Open
zh_hans: 待处理

# orders.filter.other
source: Other
zh_hans: 其他

# orders.filter.reset
source: Reset
zh_hans: 重置

# orders.filter.results
source: Results
zh_hans: 结果

# orders.filter.side
source: Side
zh_hans: 方向

# orders.filter.side.all
source: All
zh_hans: 全部

# orders.filter.side.buy
source: Buy
zh_hans: 买入

# orders.filter.side.sell
source: Sell
zh_hans: 卖出

# orders.filter.start_date
source: Start Date
zh_hans: 开始日期

# orders.filter.status
source: Status
zh_hans: 状态

# orders.filter.symbol_no_matches
source: No matching symbols.
zh_hans: 没有匹配标的。

# orders.filter.symbol_search_placeholder
source: Search symbols
zh_hans: 搜索标的

# orders.filter.symbol_selection_count_format
source: %d selected
zh_hans: 已选择 %d 个

# orders.filter.symbols
source: Symbols
zh_hans: 标的

# orders.filter.time
source: Time
zh_hans: 时间

# orders.filter.time.all
source: All Time
zh_hans: 全部时间

# orders.filter.time.custom
source: Custom
zh_hans: 自定义

# orders.filter.time.last_month
source: Last Month
zh_hans: 最近一个月

# orders.filter.time.last_three_months
source: Last 3 Months
zh_hans: 最近三个月

# orders.filter.time.last_week
source: Last Week
zh_hans: 最近一周

# orders.filter.title
source: Order Filter
zh_hans: 订单筛选

# orders.filtered.empty.description
source: Try another order filter.
zh_hans: 请尝试其他订单筛选条件。

# orders.filtered.empty.title
source: No Matching Orders
zh_hans: 没有匹配订单

# orders.live_activity.cancel.awaiting_confirmation_format
source: Confirm %@ cancellation in vicu.
zh_hans: 请在 vicu 中确认取消 %@ 订单

# orders.live_activity.cancel.dismissed_format
source: %@ cancellation closed.
zh_hans: 已关闭 %@ 撤单确认

# orders.live_activity.cancel.failed_format
source: %@ cancellation failed.
zh_hans: %@ 撤单失败

# orders.live_activity.cancel.submitting_format
source: Sending %@ cancellation request...
zh_hans: %@ 撤单请求提交中...

# orders.notional_prefix
source: Notional
zh_hans: 金额

# orders.price.current
source: Current
zh_hans: 当前

# orders.price.symbol
source: Symbol
zh_hans: 标的

# orders.quantity_prefix
source: Qty
zh_hans: 数量

# orders.recent.empty.description
source: Submitted orders will appear here.
zh_hans: 提交后的订单会显示在这里。

# orders.recent.empty.title
source: No Recent Orders
zh_hans: 暂无最近订单

# orders.recent.title
source: Recent Orders
zh_hans: 最近订单

# orders.replace_price.title
source: Change Price
zh_hans: 改价

# orders.title
source: Orders
zh_hans: 订单

# orders.toast.cancel_requested_format
source: %@ cancel request sent.
zh_hans: %@ 已发送取消请求

# orders.toast.price_replaced_format
source: %@ price update sent.
zh_hans: %@ 改价已提交

# portfolio.chart_accessibility
source: Portfolio equity chart
zh_hans: 投资组合权益图表

# portfolio.empty.connect_action
source: Connect
zh_hans: 去连接

# portfolio.empty.connect_alpaca
source: Connect your account
zh_hans: 连接账户

# portfolio.empty.connect_description
source: Connect Alpaca to keep your account value and history in sync.
zh_hans: 连接 Alpaca 后会同步账户净值和历史走势。

# portfolio.empty.history_description
source: Your account is connected. History will appear here once Alpaca returns portfolio data.
zh_hans: 账户已连接，Alpaca 返回投资组合历史后会显示在这里。

# portfolio.empty.no_history
source: No history yet
zh_hans: 还没有历史数据

# portfolio.range.accessibility_format
source: Show %@ portfolio history
zh_hans: 显示 %@ 投资组合历史

# portfolio.refresh_accessibility
source: Refresh portfolio
zh_hans: 刷新投资组合

# portfolio.title
source: Portfolio
zh_hans: 投资组合

# portfolio.your_portfolio
source: Your Portfolio
zh_hans: 你的投资组合

# position_detail.asset_class
source: Asset Class
zh_hans: 资产类别

# position_detail.asset_id
source: Asset ID
zh_hans: 资产 ID

# position_detail.asset_marginable
source: Marginable
zh_hans: 可融资

# position_detail.available
source: Available
zh_hans: 可用数量

# position_detail.available_short
source: Available
zh_hans: 可用

# position_detail.average_entry_price
source: Average Entry Price
zh_hans: 平均建仓价

# position_detail.average_entry_price_short
source: Avg Price
zh_hans: 均价

# position_detail.change_today
source: Change Today
zh_hans: 今日变化

# position_detail.cost_basis
source: Cost Basis
zh_hans: 成本基础

# position_detail.cost_basis_short
source: Cost
zh_hans: 成本

# position_detail.current_price
source: Current Price
zh_hans: 当前价格

# position_detail.error_title
source: Position refresh failed
zh_hans: 持仓刷新失败

# position_detail.exchange
source: Exchange
zh_hans: 交易所

# position_detail.holdings
source: Holdings
zh_hans: 持有情况

# position_detail.instrument
source: Instrument
zh_hans: 标的信息

# position_detail.intraday_pl
source: Intraday P/L
zh_hans: 日内盈亏

# position_detail.intraday_pl_percent
source: Intraday P/L %
zh_hans: 日内盈亏比例

# position_detail.last_day_price
source: Last Day Price
zh_hans: 上一交易日价格

# position_detail.loading
source: Loading position
zh_hans: 正在加载持仓

# position_detail.long
source: Long
zh_hans: 多头

# position_detail.market_value
source: Market Value
zh_hans: 市值

# position_detail.no
source: No
zh_hans: 否

# position_detail.not_found
source: Position unavailable
zh_hans: 持仓不可用

# position_detail.not_found_description
source: The open position may have been closed or is not available.
zh_hans: 该持仓可能已经平仓，或当前不可查询。

# position_detail.overview
source: Overview
zh_hans: 概览

# position_detail.performance
source: Performance
zh_hans: 收益表现

# position_detail.pricing_cost
source: Pricing & Cost
zh_hans: 价格与成本

# position_detail.quantity
source: Quantity
zh_hans: 数量

# position_detail.quantity_unit.contract
source: contract
zh_hans: 张

# position_detail.quantity_unit.contracts
source: contracts
zh_hans: 张

# position_detail.quantity_unit.share
source: share
zh_hans: 股

# position_detail.quantity_unit.shares
source: shares
zh_hans: 股

# position_detail.quantity_unit.unit
source: unit
zh_hans: 单位

# position_detail.quantity_unit.units
source: units
zh_hans: 单位

# position_detail.share
source: Share position
zh_hans: 分享持仓

# position_detail.short
source: Short
zh_hans: 空头

# position_detail.side
source: Side
zh_hans: 方向

# position_detail.symbol
source: Symbol
zh_hans: 代码

# position_detail.title
source: Position
zh_hans: 持仓详情

# position_detail.today
source: Today
zh_hans: 今日

# position_detail.unrealized_pl
source: Unrealized P/L
zh_hans: 未实现盈亏

# position_detail.unrealized_pl_percent
source: Unrealized P/L %
zh_hans: 未实现盈亏比例

# position_detail.view_asset
source: View asset
zh_hans: 查看资产

# position_detail.yes
source: Yes
zh_hans: 是

# position_detail.your_position
source: Your Position
zh_hans: 你的持仓

# position.category.crypto.chip
source: Crypto
zh_hans: 加密货币

# position.category.crypto.empty_title
source: No Crypto Positions
zh_hans: 暂无加密货币持仓

# position.category.crypto.title
source: Crypto
zh_hans: 加密货币

# position.category.etf.empty_title
source: No ETF Positions
zh_hans: 暂无 ETF 持仓

# position.category.etf.title
source: ETFs
zh_hans: ETF

# position.category.option.chip
source: Option
zh_hans: 期权

# position.category.option.empty_title
source: No Option Positions
zh_hans: 暂无期权持仓

# position.category.option.title
source: Options
zh_hans: 期权

# position.category.stock.chip
source: Stock
zh_hans: 股票

# position.category.stock.empty_title
source: No Stock Positions
zh_hans: 暂无股票持仓

# position.category.stock.title
source: Stocks
zh_hans: 股票

# positions.category.accessibility_format
source: %@, %d positions
zh_hans: %@，%d 个持仓

# positions.empty.description
source: Connect Alpaca or refresh your account.
zh_hans: 连接 Alpaca 或刷新账户。

# positions.empty.title
source: No Positions
zh_hans: 暂无持仓

# positions.loading
source: Loading positions
zh_hans: 正在加载持仓

# positions.overview
source: Overview
zh_hans: 概览

# positions.profit_loss_prefix
source: P/L
zh_hans: 盈亏

# positions.quantity_prefix
source: Qty
zh_hans: 数量

# positions.section_title
source: Positions
zh_hans: 持仓

# positions.title
source: Positions
zh_hans: 持仓

# positions.total_intraday_pl
source: Today
zh_hans: 今日

# positions.total_market_value
source: Market Value
zh_hans: 市值

# positions.total_unrealized_pl
source: Unrealized P/L
zh_hans: 未实现盈亏

# positions.view_all.accessibility_format
source: View all %d positions
zh_hans: 查看全部 %d 个持仓

# risk.decision.account_missing_static
source: Account data is not loaded yet; only static risk checks were applied.
zh_hans: 账户数据尚未加载，仅应用静态风控检查。

# risk.decision.checks_passed
source: Risk checks passed.
zh_hans: 风控检查通过。

# risk.decision.kill_switch
source: Kill switch is enabled.
zh_hans: 熔断开关已启用。

# risk.decision.live_locked
source: Live trading is locked in Risk controls.
zh_hans: 实盘交易已在风控设置中锁定。

# risk.decision.max_order_exceeded
source: Order notional exceeds the configured max order limit.
zh_hans: 订单名义金额超过配置的最大订单限制。

# risk.global_controls
source: Global Controls
zh_hans: 全局控制

# risk.kill_switch
source: Kill Switch
zh_hans: 熔断开关

# risk.limits
source: Limits
zh_hans: 限制

# risk.live_trading_selected
source: Live trading selected
zh_hans: 已选择实盘交易

# risk.max_order
source: Max Order
zh_hans: 最大订单

# risk.max_position
source: Max Position
zh_hans: 最大持仓

# risk.paper_trading_selected
source: Paper trading selected
zh_hans: 已选择模拟盘交易

# risk.require_order_confirmation
source: Require Order Confirmation
zh_hans: 要求订单确认

# risk.status
source: Status
zh_hans: 状态

# risk.title
source: Risk
zh_hans: 风控

# risk.unlock_live_trading
source: Unlock Live Trading
zh_hans: 解锁实盘交易

# settings.app_language
source: App Language
zh_hans: 应用语言

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.clear_logo_dev_api_key
source: Clear API Key
zh_hans: 清除 API Key

# settings.language
source: Language
zh_hans: 语言

# settings.language_footer
source: English is the default app language.
zh_hans: 切换后应用界面会立即使用所选语言。

# settings.language.english
source: English
zh_hans: 英语

# settings.language.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# settings.language.system
source: System
zh_hans: 跟随系统

# settings.logo_dev_enabled
source: Use Logo.dev logos
zh_hans: 使用 Logo.dev 图标

# settings.logo_dev_footer
source: Experimental. When enabled, ticker logos are loaded from Logo.dev with the key above. When disabled or unavailable, vicu generates stable local logos from ticker symbols.
zh_hans: 实验功能。开启后会使用上方 key 从 Logo.dev 加载 ticker 图标；关闭或不可用时，vicu 会根据 ticker 生成稳定的本地图标。

# settings.theme_mode
source: Theme Mode
zh_hans: 主题模式

# settings.theme_mode_footer
source: Use System to follow the device appearance automatically.
zh_hans: 使用“跟随系统”会自动跟随设备外观。

# settings.theme.dark
source: Dark
zh_hans: 深色

# settings.theme.light
source: Light
zh_hans: 浅色

# settings.theme.system
source: System
zh_hans: 跟随系统

# settings.title
source: Settings
zh_hans: 设置

# tab.home
source: Home
zh_hans: 首页

# tab.markets
source: Markets
zh_hans: 市场

# tab.more
source: More
zh_hans: 更多

# tab.orders
source: Orders
zh_hans: 订单

# tab.search
source: Search
zh_hans: 搜索

# tab.trade
source: Trade
zh_hans: 交易

# trade.add_credentials_before_order
source: Add Alpaca credentials before placing orders.
zh_hans: 下单前请先添加 Alpaca 凭证。

# trade.confirm_message_format
source: vicu will send this order to your %@ Alpaca account.
zh_hans: vicu 会将此订单发送到你的 %@ Alpaca 账户。

# trade.confirm_title_format
source: Submit order for %@?
zh_hans: 提交 %@ 订单？

# trade.confirm.amount
source: Amount
zh_hans: 金额

# trade.confirm.environment
source: Environment
zh_hans: 环境

# trade.confirm.estimated_price
source: Estimated price
zh_hans: 预估价格

# trade.confirm.hold_action_format
source: Hold to %@
zh_hans: 长按%@

# trade.confirm.hold_progress
source: Keep Holding
zh_hans: 继续按住

# trade.confirm.limit_price
source: Limit price
zh_hans: 限价

# trade.confirm.order_type
source: Order type
zh_hans: 订单类型

# trade.confirm.quantity
source: Quantity
zh_hans: 数量

# trade.confirm.session
source: Session
zh_hans: 交易时段

# trade.confirm.short_sell_tag
source: Short Sell
zh_hans: 卖空

# trade.confirm.short_sell_warning
source: This order may sell more shares than you currently hold and open or increase a short position.
zh_hans: 该订单可能卖出超过当前持仓的股数，并打开或增加空头持仓。

# trade.confirm.side
source: Side
zh_hans: 方向

# trade.confirm.time_in_force
source: Time in force
zh_hans: 有效期

# trade.error.account_trading_blocked
source: Account trading is blocked.
zh_hans: 账户交易已被限制。

# trade.error.asset_not_fractionable
source: Asset is not fractionable.
zh_hans: 该资产不支持碎股交易。

# trade.error.asset_not_tradable
source: Asset is not tradable.
zh_hans: 该资产当前不可交易。

# trade.error.buy_exceeds_buying_power
source: Buy order value exceeds buying power.
zh_hans: 买入订单金额超过可用购买力。

# trade.error.context_not_loaded
source: Trading context is not loaded.
zh_hans: 交易数据尚未加载完成。

# trade.error.fractional_requires_day
source: Fractional orders require DAY time in force.
zh_hans: 碎股订单需要 DAY 有效期。

# trade.error.fractional_short_unsupported
source: Fractional short sales are not supported.
zh_hans: 暂不支持碎股卖空。

# trade.error.market_extended_hours_unsupported
source: Market orders cannot be marked extended-hours.
zh_hans: 市价单不能标记为盘前盘后订单。

# trade.error.notional_requires_day
source: Notional orders require DAY time in force.
zh_hans: 金额下单需要 DAY 有效期。

# trade.error.sell_exceeds_position
source: Sell quantity exceeds available position.
zh_hans: 卖出股数超过当前可用持仓。

# trade.error.short_exceeds_buying_power
source: Short sale value exceeds buying power.
zh_hans: 卖空订单金额超过可用购买力。

# trade.limit.ask
source: Ask
zh_hans: 卖价

# trade.limit.bid
source: Bid
zh_hans: 买价

# trade.limit.bid_ask_format
source: Bid %@ · Ask %@
zh_hans: 买价 %@ · 卖价 %@

# trade.limit.mid
source: Mid
zh_hans: 中间价

# trade.limit.number_of_shares
source: Number of shares
zh_hans: 股数

# trade.limit.price
source: Limit price
zh_hans: 限价

# trade.limit.shares_available_format
source: %@ shares available
zh_hans: 可用 %@ 股

# trade.order_submitted
source: Order submitted.
zh_hans: 订单已提交。

# trade.simple.buying_power_available_format
source: %@ buying power available
zh_hans: 可用购买力 %@

# trade.simple.close_trade
source: Close trade
zh_hans: 关闭交易

# trade.simple.continue
source: Continue
zh_hans: 继续

# trade.simple.decimal_point
source: Decimal point
zh_hans: 小数点

# trade.simple.delete
source: Delete
zh_hans: 删除

# trade.simple.dollars
source: Dollars
zh_hans: 金额

# trade.simple.enter_amount
source: Enter Amount
zh_hans: 输入金额

# trade.simple.estimated_credit
source: Est. credit
zh_hans: 预估入账

# trade.simple.estimated_debit
source: Est. debit
zh_hans: 预估扣款

# trade.simple.exceeds_position
source: Exceeds Position
zh_hans: 超出持仓

# trade.simple.insufficient_buying_power
source: Insufficient Buying Power
zh_hans: 购买力不足

# trade.simple.market_order
source: Market order
zh_hans: 市价单

# trade.simple.max
source: Max
zh_hans: 最大

# trade.simple.order_type_title_format
source: %@ order
zh_hans: %@单

# trade.simple.order_unavailable
source: Order Unavailable
zh_hans: 暂不可下单

# trade.simple.position_available_format
source: %@ shares · %@ position value
zh_hans: 持有 %@ 股 · 持仓市值 %@

# trade.simple.review_order
source: Review Order
zh_hans: 复核订单

# trade.simple.shares
source: Shares
zh_hans: 股数

# trade.simple.short_unavailable
source: Short Unavailable
zh_hans: 暂不可卖空

# trade.simple.submitting
source: Submitting...
zh_hans: 正在提交...

# trade.warning.execution_price_unavailable
source: Latest executable price is unavailable.
zh_hans: 暂时没有可用的预估成交价。
